Updated README with screenshots
